[{"Name":"Emily Force","FavoriteSong":"UGH! by The 1975","Audio":"ughbythe1975.mp3","Genre":"Rock","Subgenre":"alt_rock","Color1":"#ffccee","Color2":"#ff00f7","Color3": "#0d00ff","Color3":"#ccfbff","Color4":"#0d00ff","Senses2":"dance","SpeedOfSound":"10s","Why":"Sonically, I think its really interesting how they juxtapose the upbeat music with the self introspection. The song has a very groovy feeling but talks about addiction, how other people perceive you (the looking glass self) and how you are kind of always looking for a greater satisfaction. This song is such a catharsis for me when I listen to it because I can either focus on the upbeat music or really contemplate the lyrics and look inwardly onto myself. ","HowWouldTheyDescribeIt":"Self acceptance of a bad habit and understanding how we cope in different ways. When you listen to it, it makes you really question yourself, but at the same time, it takes over your entire body and makes you want to move to it. It also is just so groovy and reminds me a bit of Prince.","Senses":"I associate the colors blue and pink (flashes of light in those colors). It makes you want to dance but the content is very complex so its a weird dissociation.","Memories":"The best memories I have are somehow also associated with this song. This song came out when all of my best friends were leaving for college. We would listen to it all the time while we drove around, with the windows down, screaming the lyrics. The song gives me such a visceral reaction of emotion and nostalgia for those lifelong friendships."},{"Name":"Vivian Yip","FavoriteSong":"For Elise by Saint Motel","Audio":"forelisebysaintmotel.mp3","Genre":"Pop","Subgenre":"indie_pop","Color1":"#bfdaff","Color2":"#ffb05c","Color3":"#ffd000","Color4":"#bfdaff","Senses2":"dance","SpeedOfSound":"2s","Why":"It's fun, upbeat, makes me happy when I'm down","HowWouldTheyDescribeIt":"It's a BOP","Senses":"It makes you want to tap your foot to the song","Memories":"I don't know why, but I feel like if I was in a coming of age movie, this would be my theme song. Like whenever walk down the streets and this song comes on, I'm like, \"yeah I'm in a movie now\""},{"Name":"Eric Osovsky","FavoriteSong":"Perfect Places by Lorde","Audio":"perfectplacesbylorde.mp3","Genre":"Pop","Subgenre":"alt_pop","Color1":"#e3b717","Color2":"#e3b717","Color3":"#db0404","Color4":"#2817e3","Senses2":"dance","SpeedOfSound":"0.5s","Why":"It's why I love pop music. It creates space to dance through a moment in one's life, all the while speaking to me in a way beyond language. It's not just the lyrics, but also the language of the beats and the way my body reacts to the rhythm. It makes me want to dance. And it makes me question myself.","HowWouldTheyDescribeIt":"It's the acceptance of a moment in time. Lorde is processing the transition from teenage adolescence to adulthood, whatever that means or looks like, and the anxieties and ambiguities in which a transition engenders. Its the idea of feeling one's feelings within this specific moment in time...and we're literally dancing to it. It's a criticism of ourselves, but we also know what we're getting at. And we accept it.","Senses":"It makes me feel like I have the potential to see color, as Lorde does when she hears music. It makes my body vibrate and move in ways that nothing else can make it. I feel awake and alive and beautiful and like all I'm meant to do in the world is dance. Like that is my purpose.","Memories":"Besides listening to it on the street and strutting to it around NYC, my other memories of listening to Perfect Places is with my best friend Noa, in her car, driving endlessly around LA during sunset. Driving on Mulholland and stopping at our spot which has a lion statue in the HOllywood Hills that overlooks all of Los Angeles. A kind of \"perfect places\" in itself. "},{"Name":"Molly Cohen","FavoriteSong":"What's Up by 4 Non Blondes","Audio":"whatsupby4nonblondes.mp3","Genre":"Rock","Subgenre":"alt_rock","Color1":"#e37b19","Color2":"#e39619","Color3":"#ffb338","Color4":"#e39619","Senses2":"empowers","SpeedOfSound":"0.75s","Why":"I like to think of it as the anthem of my life. Whenever things are going wrong and not working out like I hoped they would, I would just sing the chorus in my head and ask myself, \"What's going on?\"","HowWouldTheyDescribeIt":"It's kind of known for being super climatic. It starts out mellow and souldful, but then at the bridge you start to feel the angst and frustration. The chorus is a release of all of those emotions.","Senses":"I feel  empowered and almost overjoyed, like a light is filling my insides and at the chorus, it just bursts through. The end of the song is the same as the beginning, which feels super satisfying, it makes me feel complete. It is also very nostalgic for me. ","Memories":"I don't remember the very first time I heard it, but I've known the melody of it my whole life. I didn't rediscover it until I was in high school, and I wanted to find out what song matched the melody in my head. I haven't stopped listening to it since then. "},{"Name":"Emily Musgrave","FavoriteSong":"The Boxer by Simon & Garfunkel","Audio":"theboxerbysimon&garfunkel.mp3","Genre":"Rock","Subgenre":"folk_rock","Color1":"#bcdee6","Color2":"#becbcf","Color3":"#99b4bd","Color4":"#e6f3f7","Senses2":"breathless","SpeedOfSound":"10s","Why":"I listen to Simon & Garfunkel whenever I don’t know what to listen to and this is probably my favorite song of theirs. I keep coming back to it. ","HowWouldTheyDescribeIt":"Like most Simon & Garfunkel songs, it’s a song whose energy builds and builds as the story of the lyrics unfolds until it finally releases that energy, and your captivation, at the end. It can be quiet and easy to listen to while doing work, but it also can be great for daydreaming during long car rides. ","Senses":"One of the most significant sensory details of this song are the hits during the chorus meant to resemble the smacking of boxing gloves. There’s a great point about three minutes in during the lyric that goes “and he carries the reminders of every glove that laid him done or cut him til he cried out” where a natural emphasis occurs on the word “cut,” mimicking the hits of the chorus. Sometimes this moment will actually make my breath catch it’s so effective. ","Memories":"I have general memories of listening to this song while driving through California: road tripping to San Francisco, going across the Golden Gate Bridge and up into Marin County, driving through the Santa Monica mountains in the mornings when I worked in LA for that summer."},{"Name":"Erin Rusek","FavoriteSong":"Let Down by Radiohead","Audio":"letdownbyradiohead.mp3","Genre":"Rock","Subgenre":"alt_rock","Color1":"#071678","Color2":"#20309e","Color3":"#5f2aa3","Color4":"#730e47","Senses2":"chills","SpeedOfSound":"5s","Why":"I.. like.. I'm not even being dramatic, this sounds so stupid but truly... it makes me feel like Ｎｏｓｔａｌｇｉｃ for the 90s even though I didn't live through them.","HowWouldTheyDescribeIt":"It's like an alt-indie/rock song. Ya know, the whole shibang, guitars, bass, drums, a couple tambourines, a producer. In terms of sound, I've been told by people who haven't listened to it before and weren't used to it that it's pretty chaotic and jumbled sounding up until verse 3. Idk why that is though, I feel like I can feel 1 succinct flow through it all","Senses":"What's that feeling where you get goosebumps/shivers when listening to something really pretty? Is it frisson? That's what I feel (I actually sat down and tracked it out hahaha: frisson on the intro instrumentals; the pre-chorus; and chorus). Also that feeling like you're gonna cry?!?! ","Memories":" Memories of failing but getting ..."},{"Name":"Sophie Beceiro","FavoriteSong":"Lofi by JW Francis","Audio":"lofibyjwfrancis.mp3","Genre":"Pop","Subgenre":"lofi_pop","Color1":"#ff78eb","Color2":"#c76df7","Color3":"#6dc4f7","Color4":"#ff78eb","Senses2":"dance","SpeedOfSound":"0.75s","Why":"Why bc it literally makes me so happy like this song comes on and i just wanna hop around it’s so cute","HowWouldTheyDescribeIt":"I literally don’t know how i would describe this but he describes his music as “sincere Lofi AM radio bedroom jangle pop.”","Senses":"It just makes me want to dance around to it!","Memories":"Memories with this song uhh so many but my fave: 3am had just gotten home from a show and we were listening to music and getting ready to crash and this song came on and me and mariss just started like jumping and dancing around it was very wholesome"},{"Name":"Gabriele Trevisani","FavoriteSong":"Hijo de su Madre by Omar Apollo","Audio":"hijodesumadrebyomarapollo.mp3","Genre":"rnb","Subgenre":"alt_rnb","Color1":"#0f2edb","Color2":"#0ff3ff","Color3":"#5e0be3","Color4":"#e30be3","Senses2":"dance","SpeedOfSound":"0.75s","Why":"I can listen to this song at given any moment of the day. There's so much build up and anthem-like qualities in this song that make it so electrifying. It's full of satire and irony while still having a sense of charm. This song just makes you feel cool. It makes you feel sexy.","HowWouldTheyDescribeIt":"You honestly just have to listen to it. He has such an interesting perspective and voice. Its super empowering and such a great song to dance to. I think you [Emily] put it the best way, he reminds of me of Rex Orange County mixed with Prince.","Senses":"This song makes me want to thrash. There's so many moments of build up and the beat energizes you.","Memories":"I remember the first time I showed you [Emily] this song and we literally listened to it on repeat for who knows how long. And we just danced around to it all night until like 3 am."},{"Name":"Luca Feldman","FavoriteSong":"Rhiannon (Live) - 1977 by Fleetwood Mac","Audio":"rhiannonbyfleetwoodmac.mp3","Genre":"Rock","Subgenre":"folk_rock","Color1":"#7f996e","Color2":"#48784a","Color3":"#487866",  "Color4":"#486778","Senses2":"catharsis","SpeedOfSound":"0.75s","Why":"Stevie Knicks speaks to my soul, her mysticism and energy makes me feel so powerful and this song makes me feel confident in any situation. ","HowWouldTheyDescribeIt":"If you haven't heard this song, what have you been doing your entire life? It really changed me and shaped who I am today. The driving beat builds you up and makes you feel unstoppable. There's so much soul in this song and the more you listen to it, the more you find out about yourself.","Senses":"Whenever I listen to this song, I have this immense wave of emotions; from complete elation to a therapeutic catharsis. Her voice literally feels as though she's speaking to my soul and it makes me feel like I'm alive","Memories":"I listen to this song every morning, however, the best memory I have with this song is with my older sister. We would always listen to this song growing up and we have this weird infatuation and obsession with Stevie Knicks. I remember one time, we were listening to this song on repeat for 2 hours straight and screaming the lyrics at the top of our lungs."},{"Name":"Kate Blaylock","FavoriteSong":"Wait For Me by Motopony","Audio":"waitformebymotopony.mp3","Genre":"Rock","Subgenre":"acoustic_rock","Color1":"#2f5b73","Color2":"#486a7d","Color3":"#4f487d","Color4":"#8a4170","Senses2":"catharsis","SpeedOfSound":"10s","Why":"This song is about like waiting for the one person that is supposed to be or like true love and not being quite ready yet or finding that person and there’s just something about that song that’s like so beautiful to me As someone who’s very much so I’ll romantic I really like the notion behind there’s this person that is meant to be for me that I’ve always dreamt about yet I’m not ready for this person or they’re not ready for me and I haven’t met them yet but I will wait for you ","HowWouldTheyDescribeIt":"The first couple seconds you here like this guitar that is just plucking it and the sound that kind of sounds like when you just start a record player and it prickles a bit I don’t know if that makes sense but to me it gives me that feeling","Senses":"This song always makes me feel like I need to take a step back when things are like overwhelming or I’m sad or lonely late at night I’ll listen to this and I’ll just think it’s one of those self reflective songs for me","Memories":"And the memory associated with the song is two things one when I first heard it I was like maybe 16 in Manchester visiting family and there’s this really cool store called the Afleck which honestly you would really love because it’s like a multitude of things it’s a bunch of boutiques but also that’s like grungy punk store and it has music and posters and it’s just amalgamation of a ton of things like that until one store and they were playing and I Shazam did it and I could not stop listening to it in the car ride home when it was like pouring rain I just looked out the window listening to this song"},{"Name":"Kayla Reece","FavoriteSong":"Beverly Hills by Weezer","Audio":"beverlyhillsbyweezer.mp3","Genre":"Rock","Subgenre":"alt_rock","Color1":"#fff200","Color2":"#ffc400","Color3":"#ff9100","Color4":"#03eeff","Senses2":"chills","SpeedOfSound":"0.75s","Why":"I never skip this song. It reminds me of my childhood because my mom showed me it and would play it in the car. It's the perfect song to head-bang to and it also reminds me of California and the feeling that comes with it which makes me feel happy. The lyrics also give off a persona that I wish I could live like.","HowWouldTheyDescribeIt":"I would describe it as 90s alternative rock. It has really loud parts, quiet parts, and is kind of a rollercoaster but in a good way.","Senses":"I get chills sometimes. I also feel nostalgia and bliss","Memories":"I have memories of my mom playing it in the car with me and singing it. I also played this song when I visited LA and Beverly Hills and so now, those memories are connected to it as well. Although I font to live in California, I love the certain alternative/ rock/ skater lifestyle and I like to long to be that way although I never will be"},{"Name":"Jordan Saridakis","FavoriteSong":"Tongue Tied by Grouplove","Audio":"tonguetiedbygrouplove.mp3","Genre":"Pop","Subgenre":"indie_pop","Color1":"#ff03ea","Color2":"#ff61f2","Color3":"#a061ff","Color4":"#61efff","Senses2":"dance","SpeedOfSound":"0.5s","Why":"This song instantly puts me into a good mood and it's a song I never skip. It reminds me of vacation and good times and overall it just has a good and fun vibe to it. I first heard it on Twitter from a video of Post Malone singing to it and he looked so happy jamming to it, so that's when I decided to listen to it and it made me feel the same way.","HowWouldTheyDescribeIt":"I would describe it as a mix of pop and alternative.","Senses":"It reminds me of summer for some reason and like I said, it instantly puts me into a better mood. It's definitely a song you could sing your heart out to ","Memories":"I first heard this song in the summer of 2017 & for me that was one of the best summers I have had. So that is probably why the song makes me feel so happy."},{"Name":"Kylie Roden","FavoriteSong":"The House of the Rising Sun by The Animals","Audio":"thehouseoftherisingsunbytheanimals.mp3","Genre":"Rock","Subgenre":"rock_sub","Color1":"#e87015","Color2":"#e83f15", "Color3":"#a80707","Color4":"#a80707","Senses2":"chills","SpeedOfSound":"5s","Why":"This is such a chill song and makes me feel nostalgic for some reason and just is an all around bop","HowWouldTheyDescribeIt":"Alt","Senses":"Reminds me of the Fourth of July and summer because of some memories","Memories":"My friend who lives in Pennsylvania sang this at the park when we watched fireworks and it was dope because everyone that was there clapped at the end. I have a recording saved of it and when I really miss her, which is like always because she goes to school in Virginia, I listen to it. It was the Fourth of July when she did this and we rode in the bed of her Dad's truck with her cousins on the way home we sang songs to her cousin's guitar."},{"Name":"Marc Hudeck","FavoriteSong":"Eugene by Sufjan Stevens","Audio":"eugenebysufjanstevens.mp3","Genre":"Folk","Subgenre":"indie_folk","Color1":"#5e8a8a","Color2":"#81a6a6","Color3":"#a7d4d4","Color4":"#f7f5ab", "Senses2":"chills","SpeedOfSound":"10s","Why":"This song is so calming and serene. I relate to his lyrics in the way that he portrays his childhood and the disappearance of innocence. He talks about how he wants/needs to be near his mother and the filtered memory of her. The lyrics that really stick with me are the ones about the moment you realize what the cigarettes actually are and how you actually have memories of different types of ashtrays you remember just lying around from your childhood. They became as vivid a memory as the layout of a childhood home. A cigarette burn that as a mistake, or hot ashes hitting your arm from an open car window. Why would mom or dad or mom and dad keep something so close to them that causes so much harm, you wondered then. they keep it closer to themselves than you to them. ","HowWouldTheyDescribeIt":"Understanding the filtered reality one has made in their memories. Understanding the complexities of their relationships with their parents and never fully knowing who they were before you came into their life. It gives me this bittersweet sense of comfort knowing that others feel this way, but also a weird sense of mortality. ","Senses":"The harmonies in this song give me chills. The softness of his voice just makes you want to drift away.","Memories":"I remember first listening to this song when I moved away to college. I had this weird revelation with the lyrics in my head and find new meanings to it all the time. This song gives me solace and calms me down whenever I feel anxious."},{"Name":"Sharon Kim","FavoriteSong":"Saint Pablo by Kanye West","Audio":"saintpablobykanyewest.mp3","Genre":"hip_hop","Subgenre":"hiphop_sub","Color1":"#ff9500","Color2":"#cc7d0e","Color3":"#cc4a0e","Color4":"#d42020","Senses2":"empowers","SpeedOfSound":"3s","Why":"I love how Kanye is so real with the struggles he's going through at that time, especially being in debt and feeling people trying to use him. Also, he questions where God is which gives it a greater perspective on his purpose. Sometimes I felt that way too","HowWouldTheyDescribeIt":"Some clips of the song come out unexpected, like you wouldn't know how the next piece of the song would go which gives it more impact in its meaning I feel. It's not supposed to feel calming, but empowering and impactful","Senses":"It motivates me to work harder and consistently remind myself to work towards my goals and take care of the people I love","Memories":"I've been going through a time when I was in a pursuit to try a lot of things which I happened to get certain recognitions for, and consequently I also noticed how people tried to use me for their own benefit- trying to be friends when they didn't actually care about me but only what I had to offer."},{"Name":"Lindy Woods ","FavoriteSong":"All Falls Down by Zedd","Audio":"allfallsdownbyzedd.mp3","Genre":"Pop","Subgenre":"electro_pop","Color1":"#24f8ff","Color2":"#a34dff","Color3":"#f34dff",  "Color4":"#990014","Senses2":"empowers","SpeedOfSound":"2s","Why":"It is so true and it cheers me up when I am sad or not happy.","HowWouldTheyDescribeIt":"Mooddddddd","Senses":"Sad but more importantly STRONG","Memories":"Bad times back in high School lol"},{"Name":"Brigitte Ugarte","FavoriteSong":"Heaven Knows by Donna Summer","Audio":"heavenknowsbydonnasummer.mp3","Genre":"Disco","Subgenre":"disco_sub","Color1":"#d60000","Color2":"#fa1b1b","Color3":"#ff4040","Color4":"#a85cff","Senses2":"dance","SpeedOfSound":"0.5s","Why":"I'm reminded of my favorite decade (the 1970s) and lose myself in the dance and the beat.","HowWouldTheyDescribeIt":"It's a song about passionate love and reminding a person you have feelings for to not forget about your worth. It's upbeat. Dramatic. It's a plea and a release of energy.","Senses":"Bright flashing colors (Purples and Reds). Swinging hips. Giant earrings. Strobe lights. Prayer. Church.","Memories":"I think of my mom playing audio cassettes at home and blasting music in her car. Donna Summer and 70s/80s icons similar to her were my mother's first introductions to American culture. For me it's a song where I feel connected with my mom's past and it's the song that's gotten me through the hard/best times of my life. I can walk down a street feeling I am dance and jump. Or remind myself I'm amazing. It's happy. It's electric."},{"Name":"Matilda","FavoriteSong":"Everything I Wanted by Billie Eilish","Audio":"everythingiwantedbybillieeilish.mp3","Genre":"Pop","Subgenre":"alt_pop","Color1":"#1487b5","Color2":"#1452b5","Color3":"#1424b5","Color4":"#6f96a6","Senses2":"catharsis","SpeedOfSound":"5s","Why":"I love the vibe and the singer","HowWouldTheyDescribeIt":"Sad but it shows","Senses":"Sad vibes to turn it into happy vibes","Memories":"Smiling and being happy"},{"Name":"Jenna","FavoriteSong":"Dancing Queen by Abba","Audio":"dancingqueenbyabba.mp3","Genre":"Disco","Subgenre":"disco_sub","Color1":"#ffed4f","Color2":"#5cede8","Color3":"#d659ff","Color4":"#f824ff","Senses2":"dance","SpeedOfSound":"2s","Why":"The happiest song I can think of","HowWouldTheyDescribeIt":"Pure bliss","Senses":"Being young again","Memories":"I think of my mom."},{"Name":"Michelle Mercede","FavoriteSong":"Pedestrian At Best By Courtney Barnett","Audio":"pedestrianatbestbycourtneybarnett.mp3","Genre":"Rock","Subgenre":"psychedelic_rock","Color1":"#b52a2a","Color2":"#e8902c","Color3":"#1316b0","Color4":"#6713b0","Senses2":"dance","SpeedOfSound":"0.5s","Why":"This song makes me feel like a rebel and allows me to let out my stresses. ","HowWouldTheyDescribeIt":"the tempo is a great walking and rage song.","Senses":"Makes me head bang and think about how much I dislike some people","Memories":"This song makes me think of my first girlfriend because she introduced me to Courtney."},{"Name":"Mercedes Beceiro","FavoriteSong":"I Melt With You by Modern English","Audio":"imeltwithyoubymodernenglish.mp3","Genre":"Rock","Subgenre":"new_wave_rock","Color1":"#e336d7","Color2":"#f700e6","Color3":"#f70077","Color4":"#2900f7","Senses2":"dance","SpeedOfSound":"2s","Why":"It reminds me of a time when there were few responsibilities and life was fun and carefree","HowWouldTheyDescribeIt":"Part techno part dance","Senses":"Smooth and velvety","Memories":"My first dates with my husband many moons ago"},{"Name":"Omar Beceiro","FavoriteSong":"Letter To Hermione by David Bowie","Audio":"lettertohermionebydavidbowie.mp3","Genre":"Rock","Subgenre":"acoustic_rock","Color1":"#7a1d1d","Color2":"#800a0a","Color3":"#213482","Color4":"#1e1691","Senses2":"chills","SpeedOfSound":"5s","Why":"Dig the vocals and haunting guitars","HowWouldTheyDescribeIt":"Love lost","Senses":"Goose bumps","Memories":"Of a time when I was a sailor"},{"Name":"Michael Khan","FavoriteSong":"Musicology by Prince","Audio":"musicologybyprince.mp3","Genre":"Rock","Subgenre":"funk_rock","Color1":"#f8f2ff","Color2":"#e4d2fa","Color3":"#3d00cc","Color4":"#130129","Senses2":"chills","SpeedOfSound":"1s","Why":"I absolutely adore this song with my entire soul. It's a masterpiece. The way he constructs the storyline through the instrumental itself is so amazing and it's nothing like anything I've ever heard before. ","HowWouldTheyDescribeIt":"I would describe it as a celebration of Prince's music career. It's a large amalgamtion of all of the different themes of his music and it is just a wild ride of a song","Senses":"In the beginning, I get chills with the ambience in the background. It gives me the feeling of the of complete serenity","Memories":"The memory that I have associated with this song is when one of my best friends back home put this on a playlist for me. A lot of the songs on that playlist are some of my favorites of all time, but musicology is my favorite because of the diversity in the sound."},{"Name":"Nico Chilla","FavoriteSong":"Something About Us by Daft Punk","Audio":"somethingaboutusbydaftpunk.mp3","Genre":"Disco","Subgenre":"house","Color1":"#0065a3","Color2":"#03124f","Color3":"#08133b","Color4":"#0339fc","Senses2":"catharsis","SpeedOfSound":"5s","Why":"I can't think of a song that intuitively strikes a chord with me like this one does, and it continues to do so even after having listened to it a million times over the years since I discovered it.","HowWouldTheyDescribeIt":"To me it feels like they captured a fleeting moment of self-assurance, intimacy, and warmth.","Senses":"Not really - I just listen to the music and let it color whatever activity I'm engaged in. I guess I could say I associate the song with shades of blue and black- that could be the tone of the song, but it could also be the music video or the fact that I listen to it at night a lot.","Memories":"Maybe not a memory but I have it as one of the first songs in a playlist called \"idk yet,\" which I made at a moment of uncertainty while I was doing college apps, and has just become the thing I put on whenever life seems up in the air."},{"Name":"Andrew Coleman","FavoriteSong":"Television/So Far So Good by Rex Orange County","Audio":"tvbyroc.mp3","Genre":"Pop","Subgenre":"indie_pop","Color1":"#5acad6","Color2":"#5ad6ca","Color3":"#faa24b","Color3":"#faba4b","Color4":"#f7a10c","Senses2":"heart","SpeedOfSound":"0.5s","Why":"This song is so energizes and instantly puts me in a better mood. It's so upbeat and you just want tot jump around to it! I could listen to this on repeat and never get sick of it. The guitar riffs and the drums create so many great moments that tell a great story. The lyrics feel so much like a chant and an anthem that you instantly feel on top of the world when you listen to this song. Its just so wholesome and amazing.","HowWouldTheyDescribeIt":"This song is about Alex not being afraid to be himself in a relationship and overcoming the fear of vulnerability. The song starts off with this driving beat, as though he's hyping himself up. Then as the song progresses, he softens and understands the complexities of the relationship he's in, reaching a conclusion.  You just want to thrash to it, honestly.","Senses":"This song makes my heart race.","Memories":"Driving fast on the highway in the middle of the night with my best friends."},{"Name":"Arielle Lyons","FavoriteSong":"Under Pressure by Queen and David Bowie","Audio":"underpressurebyqueen.mp3","Genre":"Rock","Subgenre":"glam_rock","Color1":"#f7d80c","Color2":"#f7b00c","Color3":"#f76e0c","Color4":"#f7270c","Senses2":"dance","SpeedOfSound":"2s","Why":"I can listen to it no matter the mood","HowWouldTheyDescribeIt":"Chill, but also a bop if you want it to be","Senses":"Reflective","Memories":"Car rides with my mom"},{"Name":"Emily Scali","FavoriteSong":"Tennessee Whiskey by Chris Stapleton","Audio":"tennesseewhiskeybychrisstapleton.mp3","Genre":"Country","Subgenre":"country_sub","Color1":"#c91700","Color2":"#cc6cae","Color3":"#b070b8","Color4":"#6e0303","Senses2":"heart","SpeedOfSound":"10s","Why":"It’s a beautiful song.","HowWouldTheyDescribeIt":"It’s very smooth.","Senses":"It makes my heart feel full and is also very calming.","Memories":"It always makes me think of my husband. We would drink while cleaning the house and listening to music. This song was always on the playlist."},{"Name":"Lauren Bugara","FavoriteSong":"The Chain by Fleetwood Mac","Audio":"thechainbyfleetwoodmac.mp3","Genre":"Rock","Subgenre":"folk_rock","Color1":"#345215","Color2":"#4a632f","Color3":"#6f8755","Color4":"#828f74","Senses2":"chills","SpeedOfSound":"2s","Why":"The combo of the musicality, rhythm, lyrics and vocals is amazing.","HowWouldTheyDescribeIt":"Strong and moving","Senses":"chills and the need to move with the instrumentals and lyrics","Memories":"My grandma playing it on a road trip to Florida "},{"Name":"Elicia Gregg","FavoriteSong":"Piano Man by Billy Joel","Audio":"pianomanbybillyjoel.mp3","Genre":"Rock","Subgenre":"soft_rock","Color1":"#0f2991","Color2":"#2640ab","Color3":"#4357ab","Color4":"#ab438f","Senses2":"dance","SpeedOfSound":"5s","Why":"It reminds me of my childhood.","HowWouldTheyDescribeIt":"A classic song about life","Senses":"Warmth, Happiness, Innocence","Memories":"My grandmother dancing around her kitchen in white booty shorts and a yankee’s crop top."},{"Name":"MacKenzie Howard","FavoriteSong":"Everybody Wants To Rule The World by Lorde","Audio":"everybodywantstoruletheworld.mp3","Genre":"Pop","Subgenre":"alt_pop","Color1":"#8a1220","Color2":"#752932","Color3":"#75295f","Color4":"#b55104","Senses2":"chills","SpeedOfSound":"5s","Why":"I like how it’s really relaxed and can fit any mood i’m in. I like the whole message behind the song and how it’s a little dark with the lyrics yet is to an upbeat background. I like how straight forward it is.","HowWouldTheyDescribeIt":"I think of it as a mellow rock song","Senses":"I feel the need to head bob and feel pretty uplifted for a song that’s kinda about how self centered people are.","Memories":"This song makes me want to drive or just look out a window and chill."},{"Name":"Eliza Bain","FavoriteSong":"400 Lux by Lorde","Audio":"400luxbylorde.mp3","Genre":"Pop","Subgenre":"alt_pop","Color1":"#475863","Color2":"#4578c4","Color3":"#2929ba","Color4":"#480e8a","Senses2":"nostalgia","SpeedOfSound":"5s","Why":"The reverbed beats, the lyrics, the instrumental; it creates an atmosphere that reminds me so much of my childhood in a weird way. She captures adolescence so well in her music and I think that this song is one of her more underrated ones in the way that it's so poetic yet straightforward with how she describes certain moments in her life.","HowWouldTheyDescribeIt":"An homage to suburban adolescence.","Senses":"When she says the lyrics,\"I love these roads where the houses don't change\" I immediately imagine lines being drawn forever into the horizon line, kinda mimicking the image of the road lines passing you as you drive.","Memories":"I would always listen to this song when I would visit my friend in college and we would put this on in the car driving to and from. The lyrics are so calm and said so matter-of-factly; those moments were so small, but special. "},{"Name":"Shura","FavoriteSong":"Everybody Talks by Neon Trees","Audio":"everybodytalksbyneontrees.mp3","Genre":"Pop","Subgenre":"alt_pop","Color1":"#ff36f2","Color2":"#e309bf","Color3":"#e3097d","Color4":"#e30947","Senses2":"nostalgia","SpeedOfSound":"0.75s","Why":"Up tempo beat","HowWouldTheyDescribeIt":"Pop song","Senses":"I see red light with splashes of pink and white (think geyser)","Memories":"Fun car rides with my friends."},{"Name":"Lydia Sposaro","FavoriteSong":"Fuck You by Lily Allen","Audio":"fuckyoubylilyallen.mp3","Genre":"Pop","Subgenre":"electro_pop","Color1":"#fd7aff","Color2":"#fea8ff","Color3":"#a8f3ff","Color4":"#6eebff","Senses2":"nostalgia","SpeedOfSound":"1s","Why":"It's a bop. But mostly it's nostalgia. When I was little my family would have dance parties in the living room. This song would come on and I would feel like the coolest most badass 12 year old cuz I was listening to a song with bad words. Usually we couldn't listen to any songs that referenced anything bad but for some reason this passed.","HowWouldTheyDescribeIt":"A pop song with a lot of bad words over and over again.","Senses":"no.","Memories":"Me feeling cool as a little kid."},{"Name":"Gordon Ng","FavoriteSong":"Leash by Pearl Jam","Audio":"leashbypearljam.mp3","Genre":"Rock","Subgenre":"alt_rock","Color1":"#0c00e8","Color2":"#0087e8","Color3":"#bd0853",  "Color4":"#91010d","Senses2":"empowers","SpeedOfSound":"1s","Why":"It always puts me in a good mood","HowWouldTheyDescribeIt":"Energetic anthem ","Senses":"Pumped up and ready to take on the world","Memories":"Running through grandview and getting a boost when it came on my earbuds"},{"Name":"Nathan Demian","FavoriteSong":"C.R.E.A.M by Wu-Tang Clan","Audio":"creambywutangclan.mp3","Genre":"hip_hop","Subgenre":"hiphop_sub","Color1":"#2f708a","Color2":"#46788c","Color3":"#453491","Color4":"#913483","Senses2":"empowers","SpeedOfSound":"5s","Why":"Cause it tells a story ","HowWouldTheyDescribeIt":"90s hip hop","Senses":"I feel inspired. I feel like I am there with them (Wu-Tang Clan).","Memories":"It reminds me of my past."},{"Name":"Kexin Xiao","FavoriteSong":"Holy wars...The Punishment Due by Megadeth","Audio":"holywarsbymegadeath.mp3","Genre":"Rock","Subgenre":"metal_rock","Color1":"#e30505","Color2":"#0514e3","Color3":"#e30505","Color4":"#0514e3","Senses2":"dance","SpeedOfSound":"0.5s","Why":"It’s Megadeth yo!","HowWouldTheyDescribeIt":"Headbang full time ","Senses":"Joy","Memories":"Summer with ex"},{"Name":"Sunny Wei","FavoriteSong":"Falling by Harry Styles","Audio":"fallingbyharrystyles.mp3","Genre":"Pop","Subgenre":"soft_pop","Color1":"#c77db2","Color2":"#f783d6","Color3":"#f783aa","Color4":"#ff528c","Senses2":"heart","SpeedOfSound":"10s","Why":"Harry Styles makes feel alive again. His songs speak to me, I can listen to it on repeat and will never get tired. I transcend into a different astral plane when he sings.","HowWouldTheyDescribeIt":"Beautiful, amazing, in love","Senses":"I wanna dance and cry. I go into a trance","Memories":"Playing this song on repeat while sad"},{"Name":"Rachel Worley","FavoriteSong":"Jennifer by Trinidad Cardona","Audio":"jenniferbytrinidadcardona.mp3","Genre":"rnb","Subgenre":"soul_rnb","Color1":"#940f0f","Color2":"#993131","Color3":"#631d1d","Color4":"#b51414","Senses2":"catharsis","SpeedOfSound":"5s","Why":"The vocals are really great and easy to listen to and it hasn’t left my playlist yet so I probably like it more than I realize.","HowWouldTheyDescribeIt":"A more raw/real apology song towards an ex that I can sort of relate to. ","Senses":"Kinda puts you into a sad mood but I don’t hate that mood.","Memories":"Listened to it a first time at party when I was high."},{"Name":"Rachael Taube","FavoriteSong":"Lover You Should’ve Come Over by Jeff Buckley","Audio":"loveryoushouldvecomeoverbyjeffbuckley.mp3","Genre":"Rock","Subgenre":"alt_rock","Color1":"#506363","Color2":"#294d4d","Color3":"#1f3f47","Color4":"#18505e","Senses2":"catharsis","SpeedOfSound":"20s","Why":"It’s a really beautiful song with some of the most gorgeous lyrics, and music that really encapsulates the emotions the song is conveying","HowWouldTheyDescribeIt":"A melancholy song about a breakup one isn’t truly over, and the reflection on ones own doing in that situation and how the situation lingers on even after it’s over","Senses":"I can just really picture the lines about funeral mourners standing in the rain with their shoes being filled up with water, and the intimacy of the line “a kingdom for a kiss upon her shoulder”","Memories":"Walking around on a cloudy day listening to the song"},{"Name":"Pamela Force","FavoriteSong":"Better by Khalid","Audio":"betterbykhalid.mp3","Genre":"Pop","Subgenre":"rnb_pop","Color1":"#0f658a","Color2":"#05216e",  "Color3":"#3036b0","Color4":"#e8cadd","Senses2":"catharsis","SpeedOfSound":"10s","Why":"Because khalid is my future husband","HowWouldTheyDescribeIt":"Chill but upbeat","Senses":"I feel very mellowed out when I listen to it in my car","Memories":"My bestfriend first introduced the song to me back in 2018 and then I got really into it because 1 million on youtube danced to it"},{"Name":"Katherine Martin","FavoriteSong":"This Must Be the Place by The Talking Heads","Audio":"thismustbetheplacebytalkingheads.mp3","Genre":"Rock","Subgenre":"new_wave_rock","Color1":"#ffb57d","Color2":"#ffbd59","Color3":"#faa019","Color4":"#fae019","Senses2":"dance","SpeedOfSound":"2s","Why":"This song is just the cutest! I love the groovy sounds in the beginnning with the syncopated beats and the flutes, it just puts me in such a great mood everytime I listen to it and I will never get sick out it.","HowWouldTheyDescribeIt":"Bubbly and upbeat! It just makes you want to dance around to it","Senses":"I just want to bop around to it, the percussion has a really interesting pop to it","Memories":"It reminds me of this contemporary dance I did to it back in high school. My favorite dance teacher choreographed this very Easton Blake-esque, Martha Graham combo to it and I always think of the combo when I listen to it."},{"Name":"Montis Lim","FavoriteSong":"Ultralight Beam by Kanye West","Audio":"ultralightbeambykanyewest.mp3","Genre":"rnb","Subgenre":"rnb_sub","Color1":"#ff983d","Color2":"#ff6a3d","Color3":"#db1818","Color4":"#a60808","Senses2":"chills","SpeedOfSound":"10s","Why":"I personally love the complexity of the content within the song and the instrumentals","HowWouldTheyDescribeIt":"Modern gospel","Senses":"Flashing lights of orange, red, and white","Memories":"I mostly listen to this song at night and it always makes me contemplate life."},{"Name":"Gill Mitreuter","FavoriteSong":"Lauren by Men I Trust ","Audio":"laurenbymenitrust.mp3","Genre":"Pop","Subgenre":"indie_pop","Color1":"#eda218","Color2":"#d65227","Color3":"#214f22","Color4":"#1e1c4d","Senses2":"dance","SpeedOfSound":"5s","Why":"The bass line, the singer’s voice, and the snaps blend so perfectly together its so beautiful","HowWouldTheyDescribeIt":"A must-listen-to song. it’s like funky heavenly slow groove","Senses":"The bass line sticks out to me the most, when it changes notes i see different muted colors, like mustard yellow, like a rusty orange/red, dark forest green, and navy ish blue. her voice is like a transparent white or gold ish sheet that overlaps and interweaves the colors of the bass. the snaps just make it make sense, you know","Memories":"Learning how to play it on my bass for hours and hours until i finally nailed it. Best feeling ever"},{"Name":"Kasey Riera","FavoriteSong":"New Years Day by Taylor Swift ","Audio":"newyearsdaybytaylorswift.mp3","Genre":"Pop","Subgenre":"soft_pop","Color1":"#eb12ff","Color2":"#8febe5","Color3":"#cc70c9","Color4":"#467c80","Senses2":"nostalgia","SpeedOfSound":"10s","Why":"I relate this song to the relationship I have with my best friends throughout high school, especially during the time we all realized we’d be going do different places pursing our own dreams. Realizing that time will change us, but those memories you have won’t. As much as “distance makes the heart grow fonder” it can also cause us to forget. We spent months without talking to each other (crazy schedules) and wondering if I would ever hear from them. The song acts as a reminder that I spent so much time and energy with these people and none of it was waisted. It was used up, and we often begged for more. With everything going on in the world right now, I’m looking forward to crazy night and “dull” morning with these people again.","HowWouldTheyDescribeIt":"It’s simple, just her voice and a piano. It’s quite, but very emotional. The lyrics are very image based, she’s describing specific events going on around her, plainly. It’s New Year’s Day, not Eve, very specific difference. New Years Eve is filled with shouts and screams and joyous moments. But New Year’s Day is the calm after the storm. Most people would leave during this time, but those willing to stay, are staying forever. There’s two lyrics “hold onto the memories they will hold onto you” and “please don’t ever become a stranger who’s laugh I could recognize anywhere”. What most would probably think it sounds like a desperate plea, for me it’s asking for reassurance, that while things won’t be the same, I hope you will still remember me.","Senses":"It’s all very quiet. I imagine the clinking of dishes being put away or washed. When one by one, people of the house start waking up again. It’s all slow and foggy, not as is “I can’t remember anything foggy” but like morning dew foggy. Warm yet cool, when the sun comes up in the morning but hasn’t fully heated the earth yet.","Memories":"Three nights before officially leaving to college, when mom was picking me up and we’ll stood in a group hug for almost five minutes in silence. A few of us started sniffling, but not much was said. A wave of a hand and that’s it. Hearing this song performed live, I saw a recollection of the chaos and quite with these people, from crying on their shoulders to picking up the mess of bottles from the night before. I kinda lost it ngl, and I can’t listen to the song without crying. No song has ever done that to me."},{"Name":"Marissa Fortugno","FavoriteSong":"Crimson and Clover by Joan Jett ","Audio":"crimsonandcloverbyjoanjett.mp3","Genre":"Rock","Subgenre":"punk_rock","Color1":"#ff5efc","Color2":"#a170cc","Color3":"#cea2f5","Color4":"#949ed1","Senses2":"nostalgia","SpeedOfSound":"5s","Why":"Beyond iconic, Joan Jett singing a love song about a woman in the early 80s, shit broke boundaries!!!","HowWouldTheyDescribeIt":"A slightly aggressive tender","Senses":"Like everything has a white haze over it and its shot on shitty film ","Memories":"Me and my friend Aly went to the Cubbyhole on Halloween dressed up as Joan Jett and Elton John and qued up a bunch of Joan and Elton songs. We didnt stay long enough to hear any of them but we drunkenly yelled this song on the way home."},{"Name":"Leah Scarpati","FavoriteSong":"Muscle Memory by Moon Kissed","Audio":"musclememorybymoonkissed.mp3","Genre":"Pop","Subgenre":"synth_pop","Color1":"#b685ff","Color2":"#a368fc","Color3":"#f268fc","Color4":"#5d38ff","Senses2":"chills","SpeedOfSound":"2s","Why":"It makes me feel alive","HowWouldTheyDescribeIt":"It's sexy as fuck","Senses":"My skin gets hot and tingles, the back of my legs feel weak, my chest gets tight","Memories":"Someone across the room winking at me when it came on"},{"Name":"Nuala Vizard","FavoriteSong":"Do I Wanna Know by The Arctic Monkeys","Audio":"doiwannaknowbyarcticmonkeys.mp3","Genre":"Rock","Subgenre":"alt_rock","Color1":"#91010b","Color2":"#992830","Color3":"#5c2866","Color4":"#671e75","Senses2":"chills","SpeedOfSound":"2s","Why":"The beat and guitar part give me goosebumps every time ","HowWouldTheyDescribeIt":"A darker version of rock and roll","Senses":"Goosebumps, I always smile when I hear the intro","Memories":"Sitting on the big leather couch in my godparents’ apartment alone listening to this song and the Arctic Monkeys in general for the first time "},{"Name":"Aishaman Lynne","FavoriteSong":"Onederful by Armani White","Audio":"onederfulbyarmaniwhite.mp3","Genre":"hip_hop","Subgenre":"rap","Color1":"#ceff52","Color2":"#fff152","Color3":"#52ffd1","Color4":"#52e8ff","Senses2":"dance","SpeedOfSound":"0.75s","Why":"It has great rhythm and it just makes you instantly happy when you listen to it. The lyrics just make you feel hyped and there's so much neo-jazz elements in it","HowWouldTheyDescribeIt":"Filled with rich brass instruments that transcend the listener to a place above the clouds. Elation translated into sound, amazing.","Senses":"It makes me want to jump around to it and just be in a crowd of people who are all singing the lyrics to it along with me. There is so much loving energy in this song that gives me a warm, fuzzy feeling!","Memories":"One of my best friends put this song on a playlist that they made for me and we would listen to it all the time in the summer. Usually while sitting in parks with a small speaker."},{"Name":"Oscar Valesco","FavoriteSong":"Edge of Desire by John Mayer","Audio":"edgeofdesirebyjohnmayer.mp3","Genre":"Pop","Subgenre":"soft_pop","Color1":"#283d59","Color2":"#284e59","Color3":"#82150d","Color4":"#423f73","Senses2":"heart","SpeedOfSound":"10s","Why":"This song is such a catharsis for me. Whenever I feel sad, I just put this on and its able to articulate my emotions in ways that I couldn't. I love the relationships between the guitar riffs and the lyrics, it is so beautiful. ","HowWouldTheyDescribeIt":"A really raw and unapologetic love song about longing. Wanting to be in someone's life so badly and doing whatever it takes because you are so overwhelmed with emotion.","Senses":"The guitar solo in the bridge actually makes my heart stop sometimes with the amount of intensity it gives off. ","Memories":"This song brings back memories of my past relationships - the good and the bad. Really makes me reflect on how to navigate romantic relationships."},{"Name":"Anastasia Papakonstantinou","FavoriteSong":"Ribs by Lorde","Audio":"ribsbylorde.mp3","Genre":"Pop","Subgenre":"alt_pop","Color1":"#8e38ff","Color2":"#2626ff","Color3":"#f50cbb","Color4":"#bf0404","Senses2":"chills","SpeedOfSound":"2s","Why":"I don't even know how to describe the feelings I have for this song. The production alone, with the reverbed sounds and harmonized echoes, makes me feel like I'm being transcended into another world. When you listen to this song with headphones on, it such an immersive experience. The audio transitions from one ear to another and it gives me chills everytime.","HowWouldTheyDescribeIt":"It's an ethereal song about the fear of growing older. She is going through a transitional period and reflecting on her memories of her youth. The song feels like a dream about our youth and hope to cope with loosing it.","Senses":"In the beginning, I hear flashes of ultraviolet colors, similar to the humming of neon signs. As the humming builds up, the colors become more vibrant and then there's a release once she starts singing. Every. Single. Time. I. Get. chills.","Memories":"My friend, Eva and I went to her concert when we were both 17. When she started singing this song, we both shared this intense look of excitement and then proceeded to sob because it was LORDE SINGING RIBS."},{"Name":"Jess Meller","FavoriteSong":"Pyramids by Frank Ocean","Audio":"pyramidsbyfrankocean.mp3","Genre":"rnb","Subgenre":"rnb_sub","Color1":"#bf0404","Color2":"#ad3709","Color3":"#e39a12","Color4":"#ff4800","Senses2":"dance","SpeedOfSound":"5s","Why":"There are so many different moments in this song, it feels so cinematic. The transitions from one audio language to the next are nothing like I've ever heard before. ","HowWouldTheyDescribeIt":"It's about the regression of the respect for women, a gradual decline from being a Queen from her homeland to being abused by men in the western world. This song tells such a rich story, but also just makes you want to bop around to it.","Senses":"I just want to dance and strut down the street to it. And obviously, I associate that orange color with the song.","Memories":"I remember my friend teaching me how to play the guitar solo to this and the tips of my fingers basically bleeding because I hadn't played in a while."},{"Name":"Lilian Malay","FavoriteSong":"Edge of Seventeen by Stevie Nicks","Audio":"edgeofseventeenbystevienicks.mp3","Genre":"Rock","Subgenre":"rock_sub","Color1":"#5bb2cf","Color2":"#5b7ccf","Color3":"#675bcf","Color4":"#a35bcf","Senses2":"empowers","SpeedOfSound":"2s","Why":"STEVIE. NICKS. I love the thumping beat that goes throughout the entire song, it makes me feel so empowered. I will never skip this song because it instantly puts me in a good mood.","HowWouldTheyDescribeIt":"Empowering, beautiful, enthralling","Senses":"I feel empowered when I listen to this song and I want to strut down the street to it while wearing a trench coat with heeled boots.","Memories":"My mom used to play this song all the time growing up and we would sing it together when we were in the car."},{"Name":"Talia Mason","FavoriteSong":"Barracuda by Heart","Audio":"barracudabyheart.mp3","Genre":"Rock","Subgenre":"glam_rock","Color1":"#ff66fa","Color2":"#ac48d4","Color3":"#485dd4","Color4":"#d44848","Senses2":"dance","SpeedOfSound":"2s","Why":"Its soooo 70s, what's there not to love. Whenever I listen to it, I instantly feel cooler. The rumbling guitar gets my blood flowing, I love it.","HowWouldTheyDescribeIt":"ITS A PROTEST SONG AGAINST THE MAN. Basically, the sisters wrote this song to spite their record label executive for starting rumors about them being lovers. The rage and anger with the new wave sound is all I ever need.","Senses":"My heart starts racing really fast and I just want to thrash around to it.","Memories":"My mom used to play this one 70s and 80s radio station in the car and I remember the first time this song came on, she immediately turned it off because she thought it was too inappropriate for me to listen to when I was around 7 years old. Me being me, I went home and looked up the song title on Youtube."},{"Name":"Monica Sinaloa","FavoriteSong":"Little Wing by Jimi Hendrix","Audio":"littlewingbyjimihendrix.mp3","Genre":"Rock","Subgenre":"psychedelic_rock","Color1":"#ffa32b","Color2":"#fc65eb","Color3":"#425efc","Color4":"#ffa32b","Senses2":"catharsis","SpeedOfSound":"5s","Why":"I've been listening to a lot of Hendrix lately and this song just comes to mind. The guitar is what really sticks out to me.","HowWouldTheyDescribeIt":"Beautiful, groovy guitar. Light and playful","Senses":"It's just a really relaxing song and I've been listening to it a lot recently whenever I need a moment to breathe.","Memories":"No particular memories, just a really beautiful song to play in the background throughout daily life."},{"Name":"Max Powell","FavoriteSong":"Love My Way by The Psychedelic Furs","Audio":"lovemywaybypf.mp3","Genre":"Rock","Subgenre":"new_wave_rock","Color1":"#fc42f9","Color2":"#ce42fc","Color3":"#53f547","Color4":"#fc42f9","Senses2":"dance","SpeedOfSound":"0.75s","Why":"The synth and the darker tone of this pop music makes so happy. It just makes you want to dance and forget about your current problems. Like most people these days, I first heard it when I watched 'Call Me By Your Name' and the dance scene has been engrained in my mind.","HowWouldTheyDescribeIt":"The song is about not wanting to follow what everyone else is doing because it seems empty and meaningless. They'd rather follow their own instincts and do what they deem as worthwhile. Its this bittersweet synthy pop song!","Senses":"I honestly just can't shake the image of Armie Hammer dancing to this. But other than that, I guess I would associate the colors pink and green with this song.","Memories":"It reminds me of the summer of 2018, where my friends and I would basically only listen to this song and walk around downtown at night."},{"Name":"Jack Foguel","FavoriteSong":"Judas by Lady Gaga","Audio":"judasbyladygaga.mp3","Genre":"Pop","Subgenre":"electro_pop","Color1":"#8a011a","Color2":"#4f0311","Color3":"#0a0002","Color4":"#8a011a","Senses2":"dance","SpeedOfSound":"0.5s","Why":"I listen to Lady Gaga to feel confident and like I can conquer the world. Judas has so much fire behind it and the synthy sounds make me want to jump around to it. ","HowWouldTheyDescribeIt":"Acid pop, blasphemy, an anthem","Senses":"Flashing lights. Red. Black. Lower East Side nightclub scene.","Memories":"They would play this song all the time at this summer camp I went to when I was in grade school. It was when the 'Born This Way' album came out and everyone would ask to have them play this CD on the boombox"},{"Name":"Hillie Johnson","FavoriteSong":"Diplomat's Son by Vampire Weekend","Audio":"diplomatssonbyvampireweekend.mp3","Genre":"Pop","Subgenre":"indie_pop","Color1":"#fffd82","Color2":"#ff82fb","Color3":"#ff82c5", "Color4":"#ffe082","Senses2":"nostalgia","SpeedOfSound":"0.75s","Why":"I love this song because it's like the epitomy of happiness and warmth. Its like a slice of a digital dancehall, where we all are dancing to the synthy beats. This song is what a smile feels like.","HowWouldTheyDescribeIt":"It's cheery, carefree, and lighthearted. From my interpretation, the song is a lovestory between two people and them trying to figure out if the other likes them as well.","Senses":"The bouncy beats remind me of little bubbles popping. I don't have synesthesia, BUT if I did, I think I would associate pink and yellow with this song.","Memories":"Listening to this song with my friends after school when we would carpool home. "},{"Name":"Violet Murray","FavoriteSong":"What is Life by George Harrison","Audio":"whatislifebygeorgeharrison.mp3","Genre":"Rock","Subgenre":"rock_sub","Color1":"#ffe082","Color2":"#fff782","Color3":"#ffb482", "Color4":"#ff9182","Senses2":"nostalgia","SpeedOfSound":"3s","Why":"This is one of the best songs off of \"All Things Must Pass\". The lyrics, instrumental, and the overall rhythm of this song in combination make it one of my favorite songs of all time. ","HowWouldTheyDescribeIt":"Classic rock with a tinge of pop. Super cute and lovey.","Senses":"It just reminds me of old home videos being filmed on a shitty super8 camera.","Memories":"My grandfather loves this song and I remember him telling me a story of how he and my grandma would listen to this song when they first met. Not really my memory, but something sentimental that I attach to this song!"},{"Name":"Nicolas Solis","FavoriteSong":"Call Your Girlfriend by Robyn","Audio":"callyourgirlfriendbyrobyn.mp3","Genre":"Pop","Subgenre":"electro_pop","Color1":"#fa6bee","Color2":"#ba6bfa","Color3":"#ff0000","Color4":"#001eff","Senses2":"dance","SpeedOfSound":"0.3s","Why":"Besides Robyn being the love of my life, this song makes me want to dance and sob to it at the same time - an overwhelming amount of emotions in the span of 4 minutes. The way the music and the lyrics create this space for me to dance makes me express emotions that I wouldn't be able to articulate through my own words.","HowWouldTheyDescribeIt":"Robyn is tired of waiting on someone to call her and make her feel loved. She gives him advice about how to break up with his current girlfriend so that he can be with her instead. Because he's in love with Robyn and not the other girl. Its the expression of actions that are hard to understand and an explosion of emotions. ","Senses":"Neon lights flashing. Pink, red, blue, purple. Glitter. Tears. ","Memories":"My absolute favorite memory associated with this song is when you and I were dancing around to it at probably 3 am when we were taking a break from work. Fully violently jumping and screaming the lyrics. And then when the bridge came on, we both looked at each other and started cry laughing on the floor. Literally singing and crying as we stared into each other's eyes...far too intense and I loved it. "},{"Name":"Lucy Bentin","FavoriteSong":"Jolene by Dolly Parton","Audio":"jolenebydollyparton.mp3","Genre":"Country","Subgenre":"country_sub","Color1":"#9c4948","Color2":"#2f3c57","Color3":"#2f5737","Color4":"#9c4948","Senses2":"catharsis","SpeedOfSound":"5s","Why":"Love the vocals and the harmonies. The lyrics are so bittersweet and relatable.","HowWouldTheyDescribeIt":"Its a country song about someone being fearful of another woman's beauty and how potent it can be. ","Senses":"I don't really have any senses associated with it, I just like listening to it when I want to feel calm.","Memories":"I used to play this song a lot during the summer when I was 17 and I would listen to while I was at this lake my grandfather would always take me to."},{"Name":"Isabella Van Ranzow","FavoriteSong":"505 by Arctic Monkeys","Audio":"505byarcticmonkeys.mp3","Genre":"Rock","Subgenre":"alt_rock","Color1":"#ffffff","Color2":"#0e1852","Color3":"#ffffff","Color4":"#0e1852","Senses2":"dance","SpeedOfSound":"2s","Why":"Its so haunting and it tells a story with just the instrumental alone. The reverbed guitars and percussion give me the chills everytime. ","HowWouldTheyDescribeIt":"Its aggressive, sexy, and creates a lot of tension. ","Senses":"During the bridge when everything escalates, I just imagine white flashing lights and everyone's hair thrashing around.","Memories":"Driving around to this song in the middle of the night on the freeway when its all empty, going over the speed limit."},{"Name":"Sofia Pace","FavoriteSong":"Baby by Devendra Banhart","Audio":"babybydevendrabanhart.mp3","Genre":"Folk","Subgenre":"psych_folk","Color1":"#ff96fd","Color2":"#ff9698","Color3":"#fdff96","Color4":"#ffd296","Senses2":"nostalgia","SpeedOfSound":"5s","Why":"Its a beautiful song by a beautiful man. Super easy-going and breezy.","HowWouldTheyDescribeIt":"Psychedelic folk rock? Adorable? A breathe of fresh air? What sunsets feel like?","Senses":"When I listen to this song, it reminds me of summer sunsets on the beach and all the warmth and happiness that comes with them.","Memories":"Not really a memory, but I just always listen to this song when I'm feeling down to try and feel better."},{"Name":"Jeanelle Gonzalez","FavoriteSong":"Japanese Denim by Daniel Caesar","Audio":"japanesedenimbydanielcaesar.mp3","Genre":"rnb","Subgenre":"soul_rnb","Color1":"#c41a1a","Color2":"#f5791b","Color3":"#8a0368","Color4":"#4c0873","Senses2":"nostalgia","SpeedOfSound":"10s","Why":"One of the most beautiful and tender songs I've ever heard. The swaying guitar and vocals make my heart sing.","HowWouldTheyDescribeIt":"Soft and sensual r&b that makes you smile and laugh.","Senses":"Velvety and smooth. Rich colors.","Memories":"My boyfriend and I listen to this song all the time. When we're just sitting around and working or when we cook dinner."},{"Name":"Grace Davis","FavoriteSong":"Somebody to Love by Queen","Audio":"somebodytolovebyqueen.mp3","Genre":"Rock","Subgenre":"rock_sub","Color1":"#ffcd19","Color2":"#ff9019","Color3":"#fa8cf3","Color4":"#ad1a1a","Senses2":"dance","SpeedOfSound":"5s","Why":"It always makes me want to shout the lyrics. The way Freddie Mercury sings this just gets me everytime. Its such an anthem and I will never stop singing it.","HowWouldTheyDescribeIt":"It tells such a heartbreaking song when you really listen to the lyrics. It really captures that longing of finding love but never feeling worthy of it. Its empowering and heartbreaking all at the same time.","Senses":"Dancing and shouting the lyrics. Anywhere and everywhere.","Memories":"Summertime, when the sun is just going down and all of my friends are listening to this in the park."},{"Name":"Edwin Perez","FavoriteSong":"Something by The Beatles","Audio":"somethingbythebeatles.mp3","Genre":"Rock","Subgenre":"soft_rock","Color1":"#731010","Color2":"#a30707","Color3":"#6e2222","Color4":"#540b0b","Senses2":"catharsis","SpeedOfSound":"8s","Why":"Its such a crooner song, and the slow instrumentals mixed with the lyrics are beautiful. ","HowWouldTheyDescribeIt":"It's a lovesong about George's infatuation with this one woman. Something about her is so captivating and the way he writes about her is breathtaking.","Senses":"This song makes me want to sway around to it. If I had to associate a color to it, it would be a dark wine.","Memories":"This was the first song I learned how to play on guitar and its the one that's stuck with me all of these years."},{"Name":"Sabina Demidovich","FavoriteSong":"Rebel Girl by Bikini Kill","Audio":"rebelgirlbybikinikill.mp3","Genre":"Rock","Subgenre":"punk_rock","Color1":"#ff00d4","Color2":"#0000ff","Color3":"#ff00d4","Color4":"#0000ff","Senses2":"dance","SpeedOfSound":"0.2s","Why":"Its so rageful, grungey, and just iconic. I listen to it whenever I wanna to be like a badass. ","HowWouldTheyDescribeIt":"Great song to thrash and mosh around to. Feminist punk at its finest.","Senses":"I think I associate the smell of spray paint and whatever the Grog Shop in Cleveland smells like. Stale cigarettes.","Memories":"I remember watching the Kathleen Hana documentary for the first time over winter break when I was fourteen and thinking how inspiring her story was. I was really getting into punk music at the time, but didn't know many female bands. Bikini Kill was an epiphany for me."},{"Name":"Giselle Lopez","FavoriteSong":"Dreams by Fleetwood Mac","Audio":"dreamsbyfleetwoodmac.mp3","Genre":"Rock","Subgenre":"folk_rock","Color1":"#3d9ad9","Color2":"#3db7d9","Color3":"#3dd9d1","Color4":"#5c7bbf","Senses2":"chills","SpeedOfSound":"5s","Why":"This song feels like the title: an absolute dream. Its so ethereal and transcends itself from all other music for me. The harmonies and the wavy sounds just put me in a state of trance.","HowWouldTheyDescribeIt":"Folky rock that makes you feel like a gypsy or a witch.","Senses":"I think of shimmering water and blue skies.","Memories":"I used to listen to this song in the car all time in my senior year of high school on my way to school. I had a really old car that still had a casette player, so I put my mom's copy of \"Rumors\" in all the time."},{"Name":"Adrianna Dorantes","FavoriteSong":"Scenes from an Italian Restaraunt by Billy Joel","Audio":"scenesfromanitalianrestaurantbybillyjoel.mp3","Genre":"Rock","Subgenre":"pop_rock","Color1":"#6e0505","Color2":"#340763","Color3":"#081566","Color4":"#060696","Senses2":"nostalgia","SpeedOfSound":"5s","Why":"I love this song because it is what New York sounds like to me. It gives me that idealistic vision of a storybook version of New York. This song is also like five different songs in one and I love the diversity in sound. ","HowWouldTheyDescribeIt":"Jazzy, rock n roll, classy, a full cinematic story in one song.","Senses":"When I hear this song, I think of people walking around Little Italy with all of the cute twinkly lights at night and how carefree that feels.","Memories":"Singing this song in the streets at night with my family when they came to vist me in New York! I remember us dancing around in Little Italy and Soho as I blasted this song from my phone. Many people were giving us looks of disgust, but this one older man joined in with the singing."},{"Name":"May Whitney","FavoriteSong":"Tiny Dancer by Elton John","Audio":"tinydancerbyeltonjohn.mp3","Genre":"Rock","Subgenre":"pop_rock","Color1":"#caaecf","Color2":"#f4b5ff","Color3":"#ffb5df","Color4":"#ffb5c0","Senses2":"nostalgia","SpeedOfSound":"5s","Why":"This song is gives me such a nostalgic feeling and whenever I think of it, I want to dance and cry to it. The lyrics and the piano are just gorgeous.","HowWouldTheyDescribeIt":"Classic pop rock with beautiful instrumentals","Senses":"It makes me feel beautiful, it makes my heart sing and dance.","Memories":"When I first started ballet, my mom gave me the nickname of \"Tiny Dancer,\" so now its forever our favorite song."},{"Name":"Sarah Smith","FavoriteSong":"Golden Hour by Kacey Musgraves","Audio":"goldenhourbykaceymusgraves.mp3","Genre":"Country","Subgenre":"country_pop","Color1":"#ff903b","Color2":"#d636cb","Color3":"#fa7b19", "Color4":"#7da5fa","Senses2":"nostalgia","SpeedOfSound":"10s","Why":"Kacey Musgraves is the country music I can tolerate and this song is absolutely precious. The way she writes is so poetic and beautiful, comparing someone you love to your \"Golden Hour\" is so tender and endearing. This song is so relaxing, like a daze.","HowWouldTheyDescribeIt":"This song is a lovesong about how that one person can make you feel warm and safe. You share this secret universe with them and that is what makes you feel reassured in this life.","Senses":"I think of shimmering water, sunsets, and the feeling of warmth.","Memories":"At the end of the summer, before my friends and I left to go back to college, we made the spontaneous decision to go to this one park near the water and watch the sunset. It was such a special moment listening to this song while watching the water pass and the birds fly over us. It felt like a dream."},{"Name":"Katherina Nell","FavoriteSong":"Tenerife Sea by Ed Sheeran","Audio":"tenerifeseabyedsheeran.mp3","Genre":"Pop","Subgenre":"acoustic_pop","Color1":"#80e0dd","Color2":"#80cee0","Color3":"#a7d5eb","Color4":"#09406e","Senses2":"chills","SpeedOfSound":"10s","Why":"I feel like this is one of his underrated songs, but I love the lyrics to this song and how simple yet charming it is. The harmonies give me goosebumps everytime I listen to this song with headphones on. ","HowWouldTheyDescribeIt":"Acoustic guitar lovesong with beautiful layered vocals and guitar.","Senses":"I think of waves when I listen to this song.","Memories":"I remember first listening to the demo of this song when Ed first played it at Madison Square Garden. I converted the demo from Youtube to an mp3 and would play it all the time. It felt like it was my own secret song that I only knew about and no one else."},{"Name":"Cameron Watson","FavoriteSong":"This is Gospel by Panic! at the Disco","Audio":"thisisgospelbypatd.mp3","Genre":"Pop","Subgenre":"alt_pop","Color1":"#002aff","Color2":"#8800ff","Color3":"#ff00ff","Color4":"#ff0033","Senses2":"dance","SpeedOfSound":"0.75s","Why":"Look, I know I said I wasn't going through and emo phase anymore but this song continues to hit. It just helps me release so much energy and emotion. Also, suppperr catchy.","HowWouldTheyDescribeIt":"Its a song about struggling with addiction. This song just empowers people who are going through a hard time to take control of their lives and find themselves.","Senses":"I always have the urge to shout the \"uh oh oh uh oh oh uh oh oh\" part. Also, to thrash around to this entire song.","Memories":"My favorite memory associated with this song was when I went to go Panic! with my friends and we literally drove like 2 hours away to go to this concert after school. It was a Tuesday and somehow we made it work. After the concert, we drove the 2 hours back home and probably only got around an hour sleep. Totally worth it."},{"Name":"Alfie Crandall","FavoriteSong":"Why Generation by FIDLAR","Audio":"whygenerationbyfidlar.mp3","Genre":"Rock","Subgenre":"punk_rock","Color1":"#ff0000","Color2":"#ff7300","Color3":"#ffd000","Color4":"#ff0000","Senses2":"dance","SpeedOfSound":"0.75s","Why":"I love how blunt and rageful this song is. It just makes me feel cool.","HowWouldTheyDescribeIt":"It's about the struggles we are facing in this generation. Its full of anger and revenge and yet, still makes me feel happy go figure","Senses":"Not really senses, but I think of old dive bars and grungey basement venues.","Memories":"One summer, my friends and I drove around and went to old abandoned buildings. This was one of the songs on the playlist we listen to and it just reminds me of how much fun we would have."},{"Name":"Tai Scott","FavoriteSong":"3005 by Childish Gambino","Audio":"3005bychildishgambino.mp3","Genre":"hip_hop","Subgenre":"indie_hip_hop","Color1":"#ff9500","Color2":"#ff8000","Color3":"#ff6a00","Color4":"#ffa200","Senses2":"dance","SpeedOfSound":"2s","Why":"Its so catchy man I love the production and flow. It love the different syncopations and the different textures in the song.","HowWouldTheyDescribeIt":"A super fun and catchy love song. It's also kind of existential, I think he really captures how this life is one that we only get one chance at and if we don't spend it with the people we love, then what's the point?","Senses":"Its so groovy, I just want to dance around to it. I think if I had to attach a color to it, it would be like a fanta orange.","Memories":"My first girlfriend and I used to listen to this song all the time."},{"Name":"Angelo Aldalwan","FavoriteSong":"A Certain Person by Light Asylum","Audio":"acertainpersonbylightasylum.mp3","Genre":"Pop","Subgenre":"new_wave_pop","Color1":"#b60aff", "Color2":"#330aff","Color3":"#0afff3","Color4":"#1eff0a","Senses2":"dance","SpeedOfSound":"2s","Why":"The synthy background music makes me so happy! I love how 80s it feels, like a renaissance of the electro-pop from that era in a modern context.","HowWouldTheyDescribeIt":"Electro-pop, 80s, synth. The song is about lost love and trying to make sense of it.","Senses":"Might not be the senses, but associate 80s arcades with this song. It just reminds me of the soundtracks to those games and all of their bright colors.","Memories":"I remember hearing this song in a club in Soho and immediately falling in love with it. It felt so cinematic."},{"Name":"Carly Bell","FavoriteSong":"Don't Think Twice, Its Alright by Bob Dylan","Audio":"dontthinktwiceitsallrightbybobdylan.mp3","Genre":"Folk","Subgenre":"folk","Color1":"#749692","Color2":"#99c4bf","Color3":"#99a9c4","Color4":"#799c8e","Senses2":"chills","SpeedOfSound":"5s","Why":"I listen to Bob Dylan whenever I want to feel at ease and just relax. This song is one that I always come back to because of the guitar and the lyrics.","HowWouldTheyDescribeIt":"Its really mystifying and poetic. I think most people think this song is a love song, but I think its more about how to cope with not having your loved one be near you and finding comfort in autonomy.","Senses":"The guitar gives me chills. When I listen to this song on a high volume at night, it seems like I can feel the echo of his voice.","Memories":"I remember listening to this song when I was going through a hard time and it was something that brought me a lot of comfort."},{"Name":"Danny Joseph","FavoriteSong":"See You Again (feat. Kali Uchis) by Tyler, the Creator","Audio":"seeyouagainbytylerthecreator.mp3","Genre":"hip_hop","Subgenre":"hiphop_sub","Color1":"#ffa545","Color2":"#ff8045","Color3":"#ffd445","Color4":"#e045ff","Senses2":"nostalgia","SpeedOfSound":"5s","Why":"I always play this song to make me smile. I love flow and rhythm it in the beginning with the syncopation. Overall, very cute and happy!","HowWouldTheyDescribeIt":"A dreamy lovesong","Senses":"Reminds me of summer and warmth","Memories":"Summers with my best friends"},{"Name":"Ash Froman","FavoriteSong":"Heart to Break by Kim Petras","Audio":"hearttobreakbykimpetras.mp3","Genre":"Pop","Subgenre":"electro_pop","Color1":"#ff00e1","Color2":"#f200ff","Color3":"#ff0073","Color4":"#ad0aff","Senses2":"dance","SpeedOfSound":"1s","Why":"I've been listening to this song a lot recently and it just makes me want to dance around to it in the middle of the night.","HowWouldTheyDescribeIt":"This song is about starting a relationship when you’re extremely infatuated with someone. Even if the relationship ends and she’ll be a mess at the end of it, she won’t mind because the experience of love was worth it. It's so fun and upbeat!","Senses":"Flashing pink and purple night club lights. The percussion feels like an actual heartbeat.","Memories":"Having dance parties to it in the middle of the night with my roommate. I love our little dance parties because it makes us feel a little more normal during quarantine."},{"Name":"Parker Carson","FavoriteSong":"What Would You Do by City High","Audio":"whatwouldyoudobycityhigh.mp3","Genre":"hip_hop","Subgenre":"hiphop_sub","Color1":"#544c87","Color2":"#33258a","Color3":"#4a4182","Color4":"#415c82","Senses2":"catharsis","SpeedOfSound":"3s","Why":"Its such an introspective song. I think the story it tells is so tragic yet I can't help but want to dance to it. It just reminds you to empathize with others because you never truly know what they're going through.","HowWouldTheyDescribeIt":"A song about a stripper trying to make ends meet and support her children. It really reminds you about the cost at which these frivolous things come at. ","Senses":"I want to dance to it because it is super catchy, but I also feel guilty dancing around to people's sorrow...","Memories":"I don't really have any memories associated with this song, I just think the story it tells is tragically beautiful."},{"Name":"John Kelman","FavoriteSong":"If Not For You by George Harrison","Audio":"ifnotforyoubygeorgeharrison.mp3","Genre":"Rock","Subgenre":"folk_rock","Color1":"#ffffbf","Color2":"#b9db9e","Color3":"#9edbc4","Color4":"#9ec3db","Senses2":"catharsis","SpeedOfSound":"7s","Why":"George Harrison is personally my favorite Beatle and I especially love this song. I honestly think it's one of the greatest modern love songs of all time. I love the swaying guitar and how it just puts me at ease. The lyrics are also so beautiful, saying he wouldn't have any light in his life with his love; with her, he just experiences life better.","HowWouldTheyDescribeIt":"An easy-going lovesong","Senses":"It gives me that warm fuzzy feeling inside. Like when you're laying outside on the grass during the springtime and you can feel the sun finally shine down. It reminds me of the smell of pollen in the air and wet grass.","Memories":"Listening to this song with my grandparents when I help cook dinner for them on the weekends!"},{"Name":"Sami Castillo","FavoriteSong":"Eventually by Tame Impala","Audio":"eventuallybytameimpala.mp3","Genre":"Rock","Subgenre":"psychedelic_rock","Color1":"#4100c2","Color2":"#c200b5","Color3":"#c2003a","Color4":"#66011f,","Senses2":"dance","SpeedOfSound":"1s","Why":"I love all of the different textures and moments in this song. There's parts where all of the different textures layer into these loud and crazy moments - and there's parts where smaller details are isolated. The dimensionality of it is insane.","HowWouldTheyDescribeIt":"It feels like a film with all of the different parts in it. It psychedelic and electrifying.","Senses":"It feels so electric and I just want to shout the lyrics and headbang in the car to it","Memories":"When I'm back home and I have a car, I drive around empty streets to this song at night on full blast and thrash around. I usually always take the same route too."},{"Name":"Hayden Dessero","FavoriteSong":"Valerie by Amy Whinehouse","Audio":"valeriebyamywinehouse.mp3","Genre":"rnb","Subgenre":"soul_rnb","Color1":"#ffe014","Color2":"#fdffa1","Color3":"#fff2a1","Color4":"#ffd8a1","Senses2":"nostalgia","SpeedOfSound":"5s","Why":"I love the amount soul and heart this has! It gives me this feeling of nostalgia and simpler times.","HowWouldTheyDescribeIt":"They feel like a fool for constantly thinking about someone who they can’t see and want the person to visit them so they can get them off their mind. They've fallen so hard for this person and the song just makes me blush thinking about it.","Senses":"It reminds me of sunny days downtown and yellow sundresses.","Memories":"Dancing around to this with my mom before I left for college. Its both of our favorite song and I remember feeling this super bittersweet feeling of leaving and starting a new chapter in my life."},{"Name":"Julie Soto","FavoriteSong":"Piece of My Heart by Janis Joplin","Audio":"pieceofmyheartbyjanisjoplin.mp3","Genre":"Rock","Subgenre":"psychedelic_rock","Color1":"#ed8f2b","Color2":"#fa9107","Color3":"#7c07e3","Color4":"#fa9107","Senses2":"catharsis","SpeedOfSound":"3s","Why":"I'm reminded of all of the music from this time period - the 60s and 70s. I love how raw and unapologetic this song is. Just makes you want to shout to the \"TAKE IT, TAKE ANOTHER LITTLE PART OF MY HEART NOW BABY\" part and it always puts a smile on my face.","HowWouldTheyDescribeIt":"Acid rock, psychedelic, and shameless.","Senses":"Just makes me want to shout the lyrics.","Memories":"I used to go to this one record store back all the time back home and one time, I walked in just to browse. This song was on as I walked in and I spent a lot of my time looking for the record with this song on it. The owner came up to and asked me what I was looking for. When I told him, he showed me where it was and gave it to me for $5. The best day ever."},{"Name":"Jessie Presch","FavoriteSong":"Pynk (feat. Grimes) by Janelle Monae","Audio":"pynkbyjanellemonae.mp3","Genre":"Pop","Subgenre":"alt_pop","Color1":"#f7c3e1","Color2":"#ff96d3","Color3":"#dba4c4","Color4":"#f081be","Senses2":"empowers","SpeedOfSound":"5s","Why":"I love how melodic and thematic it is. The gradual build up to intensity creates a nice storyline and I love the metaphors used throughout the song.","HowWouldTheyDescribeIt":"Intersectional female empowerment and being prideful of your gender identity. It very upbeat and poppy, the synthy beats are my favorite.","Senses":"It gives me chills, especially when the music becomes more intense.","Memories":"One of my favorite memories I have associated with this song is singing with my friends while my car was parked in the driveway before walking back inside my house to celebrate my best friend's birthday."},{"Name":"Malia Asahino","FavoriteSong":"Unravel Me by Sabrina Claudio","Audio":"unravelmebysabrinaclaudio.mp3","Genre":"rnb","Subgenre":"alt_rnb","Color1":"#962663","Color2":"#400101","Color3":"#8c0b34","Color4":"#962663","Senses2":"chills","SpeedOfSound":"0.5s","Why":"Oh my god. Where do I begin? This song feels so transcendent and like I'm in another dimension when I listen to it with headphones. When the chorus comes on, it feels like my soul is being lifted out of my body, there is no other way to explain it. ","HowWouldTheyDescribeIt":"It feels like I'm in a trance whenever I listen to this song. So many beautiful moments in the instrumentals that really isolate interesting textures.","Senses":"CHILLS. GOOSEBUMPS. FEELS UNREAL.","Memories":"My last final during my first semester of freshman year ended around 10 pm. I felt so happy to had finished all of my projects, so I went to S'MAC, ordered myself mac and cheese. Then I ate my mac and cheese in Washington Square Park while listening to this song on loop for about an hour. By myself. "},{"Name":"Tayte Kamoku","FavoriteSong":"Love on the Brain by Rihanna","Audio":"loveonthebrainbyrihanna.mp3","Genre":"rnb","Subgenre":"rnb_sub","Color1":"#700124","Color2":"#801839","Color3":"#4d0625","Color4":"#821417","Senses2":"chills","SpeedOfSound":"0.75s","Why":"I think this song is so versatile and different from the rest of her work. Her vocals express so many deep emotions and make my own emotions feel validated.","HowWouldTheyDescribeIt":"A soulful ballad with a beautiful orchestra. Its a song about an addictive yet destuctive relationship, trying to makes sense of love and the logic behind it. There is so much emotion in this song and it honestly makes my heart feel like it might explode.","Senses":"I feel tingly when I listen to this song when she starts singing the prechorus into the chorus. The \"Baby you got me like i-i-i-i-i-i-i-i-i-hiii, woo i-i-i-i-i-i-i-i-i-hiii Don't you stop loving me (loving me) Don't quit loving me (loving me) Just start loving me (loving me) Owwwwww\" part gets me everytime.","Memories":"Listening to it with my boyfriend while clean the apartment."},{"Name":"Claire Lucas","FavoriteSong":"Dancing in the Moonlight by King Harvest","Audio":"dancinginthemoonlightbykingharvest.mp3","Genre":"Rock","Subgenre":"pop_rock","Color1":"#5339d4","Color2":"#1835a8","Color3":"#1d18a8","Color4":"#1b0d78","Senses2":"dance","SpeedOfSound":"3s","Why":"Instantly puts me in a good mood","HowWouldTheyDescribeIt":"Sparkly, classic, summer.","Senses":"Makes me want to dance (in the moonlight) lol","Memories":"Walking around and listening to this song with my friends at night "},{"Name":"Shaylee Yamashita","FavoriteSong":"I Shall be Released by Nina Simone","Audio":"ishallbereleasedbyninasimone.mp3","Genre":"Jazz","Subgenre":"soul_jazz","Color1":"#170494","Color2":"#606b99","Color3":"#7b84a8","Color4":"#7b9ba8","Senses2":"catharsis","SpeedOfSound":"10s","Why":"This is my favorite song because I always come back to it when I don't feel the best. The warmth in her voice brings me a sense of comfort and I feel as though I'm able to breathe again.","HowWouldTheyDescribeIt":"Breezy, soulful jazz","Senses":"Candle smoke, swaying, and serenity","Memories":"My husband and I danced to this song on our wedding night."},{"Name":"Moira Cohen","FavoriteSong":"Part of the Plan by Dan Fogelberg","Audio":"partoftheplanbydanfoguel.mp3","Genre":"Rock","Subgenre":"folk_rock","Color1":"#77aced","Color2":"#93e4ed","Color3":"#a9d4d2","Color4":"#edf09e","Senses2":"nostalgia","SpeedOfSound":"5s","Why":"Things will work out","HowWouldTheyDescribeIt":"80's folk-rock","Senses":"Happy","Memories":"College-related tunes"},{"Name":"Emma Christie","FavoriteSong":"Modern Love by David Bowie","Audio":"modernlovebydavidbowie.mp3","Genre":"Rock","Subgenre":"glam_rock","Color1":"#ff0303", "Color2":"#ff8103","Color3":"#ff0389","Color4":"#ff8103","Senses2":"dance","SpeedOfSound":"2s","Why":"I love the amount of energy it has. ","HowWouldTheyDescribeIt":"80's glam rock","Senses":"Elation and bopping around","Memories":"My jazz teacher used to play this song during warm-ups and its just stuck with me"},{"Name":"Neil Cohen","FavoriteSong":"Thunder Road by Bruce Springsteen","Audio":"thunderroadbybrucespringsteen.mp3","Genre":"Rock","Subgenre":"folk_rock","Color1":"#91bfd9","Color2":"#91a3d9","Color3":"#91d9d5","Color4":"#fabfa7","Senses2":"nostalgia","SpeedOfSound":"5s","Why":"Captures Summer nights","HowWouldTheyDescribeIt":"It welcomes you into the Summer of your past and is musically flawless.","Senses":"Sweet smells","Memories":"College Summers"},{"Name":"Alexander Hicks","FavoriteSong":"Honky Cat by Elton John","Audio":"honkycatbyeltonjohn.mp3","Genre":"Rock","Subgenre":"pop_rock","Color1":"#faa7dd","Color2":"#c0a7fa","Color3":"#a7c3fa","Color4":"#a7faef","Senses2":"dance","SpeedOfSound":"2s","Why":"Instantly makes me happy, no matter what","HowWouldTheyDescribeIt":"Boogie","Senses":"Makes you want to boogie man, nothing else to it","Memories":"Reminds me of car rides with my parents"},{"Name":"Lacey Cohen","FavoriteSong":"Ironic by Alanis Morissette ","Audio":"ironicbyalanismorissette.mp3","Genre":"Rock","Subgenre":"alt_rock","Color1":"#b4a3c7","Color2":"#a3a4c7","Color3":"#7d88b8","Color4":"#b37db8","Senses2":"catharsis","SpeedOfSound":"3s","Why":"I feel that life overall is extremely ironic, and that song gives really good examples. It makes me feel better when my life feels like it’s crumbling. It’s like I’m not as alone.","HowWouldTheyDescribeIt":"Alanis is very much a story teller in it. You can picture all of the stories she’s describing and it makes you really understand how ironic life is. It feels like a big shrug in solidarity.","Senses":"Her voice is really calming and she does such a good job at painting a picture in your head. It really has an echoing effect in my head after I listen to it. The rest of the day I keep thinking “life has a funny way of sneaking up on you”.","Memories":"It used to come on the throwback radio stations in my dads car when he would pick me up from college. We would both sing along to it. Once again, it’s that solidarity that I really find comfort in."},{"Name":"Julian Ray ","FavoriteSong":"Let's Dance to Joy Division by The Wombats","Audio":"letsdancetojoydivisionbythewombats.mp3","Genre":"Rock","Subgenre":"alt_rock","Color1":"#ff2b97","Color2":"#ff2bdc","Color3":"#ffe62b","Color4":"#ff8e2b","Senses2":"dance","SpeedOfSound":"0.5s","Why":"It makes me feel alive and exhilarated.","HowWouldTheyDescribeIt":"Powerful, energetic, happy","Senses":"Thrashing around to it, especially during the chorus","Memories":"Summers going to the beach"},{"Name":"Zack Everhart","FavoriteSong":"RNP (feat. Anderson .Paak) by YBN Cordae","Audio":"rnpbyybncordae.mp3","Genre":"hip_hop","Subgenre":"funk_hiphop","Color1":"#007cf0","Color2":"#002cf0","Color3":"#6c00f0","Color4":"#bd2af7","Senses2":"dance","SpeedOfSound":"3s","Why":"I love how hype and happy this song. There are so many textures in this song and I love the groove. There are so many small nuances in this song and I keep finding new ones the more I listen to it.","HowWouldTheyDescribeIt":"Groovy syncopation","Senses":"Whenever the bass comes in, I just imagine different parts of my body isolating while the others move. The reverb feels like its vibrating throughout my entire body.","Memories":"When I first moved into my new apartment last fall, my roommates and I would listen to this song while we unpacked and tried to build our furniture. "},{"Name":"Lucas Parada","FavoriteSong":"Heroes by David Bowie","Audio":"heroesbydavidbowie.mp3","Genre":"Rock","Subgenre":"alt_rock","Color1":"#bf0000","Color2":"#e80505","Color3":"#2f1896","Color4":"#501199","Senses2":"nostalgia","SpeedOfSound":"5s","Why":"A wave of nostalgia takes over me and I feel like I'm in the tunnel scene in \"Perks of Being a Wallflower\". This song makes me feel young and optimistic. I feel like I'm on top of the world when I listen to it and I will never get sick of that feeling.","HowWouldTheyDescribeIt":"It sounds like this fantasy world. His voice is so earnest and the instrumentals make you feel alive.","Senses":"Wind brushing through my hair, nighlights, goosebumps.","Memories":"My friends and I were convinced that we were Charlie, Sam, and Patrick in high school, so we took a roadtrip to that exact tunnel in Pittsburgh and blasted this song while driving through. I wills never forget it."},{"Name":"Rachel Carmolinga","FavoriteSong":"Baby, I Love You by Ramones","Audio":"babyiloveyoubyramones.mp3","Genre":"Rock","Subgenre":"pop_rock","Color1":"#991197","Color2":"#721199","Color3":"#991185","Color4":"#99113a","Senses2":"nostalgia","SpeedOfSound":"3s","Why":"It's such a classic and cheesy love song. Makes my heart feel like its sweeping and singing.","HowWouldTheyDescribeIt":"An idealistic lovesong, feels like a dream","Senses":"Sweet smells and swooning","Memories":"It was my best friend's birthday and we went to this diner in Brooklyn. We were there all night and we put this on the jukebox more times than I can remember and sang our hearts out."},{"Name":"Brynn Kendro","FavoriteSong":"Black Dog by Led Zeppelin ","Audio":"blackdogbyledzepplin.mp3","Genre":"Rock","Subgenre":"rock_sub","Color1":"#eb46b1","Color2":"#b446eb","Color3":"#4e46eb","Color4":"#200db5","Senses2":"empowers","SpeedOfSound":"2s","Why":"It’s amazing, a classic, and reminds me of happy times ","HowWouldTheyDescribeIt":"Electric, powerful","Senses":"Vibrating ","Memories":"Listening to it in the car with my boyfriend "},{"Name":"Tim Bolio","FavoriteSong":"Somewhere by Jimi Hendrix","Audio":"somewherebyjimihendrix.mp3","Genre":"Rock","Subgenre":"psychedelic_rock","Color1":"#3319ff","Color2":"#19d9ff","Color3":"#19ffe0","Color4":"#fff019","Senses2":"dance","SpeedOfSound":"2s","Why":"It's so psychedelic and groovy, the guitar is actually insane!!!! Makes me feel like a badass when I listen to it","HowWouldTheyDescribeIt":"Psychedelic rock. Its makes me imagine of how people in the 60s and 70s lived; I wish I was there. The guitar is the main feature of this song and I've never heard anything like it before. I don't know if I ever will again.","Senses":"Wavy shapes, bright colors, groovy moves, and lemonade.","Memories":"Car rides with my dad"}]
